{
  "name": "Dwayne Herzberg",
  "description": "Dwayne Herzberg's portfolio",
  "mydescription": "I am a 21-year-old student in my final year of a master's degree in Embedded and Connected Systems at Paul Sabatier University. With a strong focus on embedded systems and a passion for low-level development.",
  "mydescription2": "In addition to my academic work, I enjoy creating complete projects from scratch. This includes everything from prototyping and 3D modeling in SolidWorks, to 3D printing and finalizing the product. I also regularly work on and improve my homelab, setting up various services and fine-tuning my personal server infrastructure to meet my needs and those of my family.",
  "socials": [
    { "id": "1", "title": "Github", "link": "https://github.com/HDwayne" },
    {
      "id": "2",
      "title": "LinkedIn",
      "link": "https://www.linkedin.com/in/dwayne-herzberg"
    },
    { "id": "3", "title": "Email", "link": "mailto:dwayneherzberg@gmail.com" }
  ],
  "project_upcoming": {
    "description": "Currently building a compiler from scratch (AST, quadruples, etc.), deep diving into various Instruction Set Architectures (ISA), learning AArch64 to develop a simple kernel, and exploring STM32 registers. Most of this work is done as part of my university studies, while also working on personal IoT projects and refining my skills in embedded systems",
    "partner": ""
  },
  "projects": [
    {
      "id": "1",
      "markdown": "solar_tracker",
      "github": "https://github.com/HDwayne/SolarArduino",
      "title": "Solar Tracker",
      "type": "Embedded system",
      "description": "This Solar Tracker is an embedded system that uses an Arduino or ESP32 microcontroller to track the sun's position and adjust the angle of a solar panel accordingly. By tracking the sun’s movement throughout the day, the Solar Tracker ensures the solar panel is always optimally positioned for maximum energy production.",
      "year": "2024",
      "technologies": ["c", "espressif", "platformio", "solidworks"],
      "imageSrc": "solar_tracker_main.webp"
    },
    {
      "id": "2",
      "markdown": "atmosphere",
      "github": "https://github.com/HDwayne/Atmosphere",
      "title": "Atmosphere",
      "type": "Web application",
      "description": "tool for visualizing and validating meteorological and chemical data from the Pic du Midide Bigorre environmental measurement station.",
      "year": "2023",
      "technologies": ["python"],
      "imageSrc": "atmosphere_img.webp"
    },
    {
      "id": "3",
      "markdown": "ballot",
      "github": "https://github.com/HDwayne/Scrutin",
      "title": "ballot",
      "description": "This project is a C program that determines the winner of an election using various methods such as First-past-the-post (Uninominal one round), Two-round system (Uninominal 2 rounds), Condorcet method, Resolution by Minimax method, Schulze method. The program allows for the input of candidate information and voting data, and then calculates the winner based on these different election methods.",
      "type": "Console application",
      "year": "2022",
      "technologies": ["c", "makefile"],
      "imageSrc": "ballot_img.webp"
    },
    {
      "id": "4",
      "markdown": "notyet",
      "github": "https://github.com/HDwayne/NotYet",
      "title": "NotYet",
      "description": "This project is a Windows application created with WPF technology, which provides easy access to the Celcat schedules of the Paul Sabatier University. The application allows users to quickly view their class schedules, exam dates and other crucial dates of the university.",
      "type": "WPF Application",
      "year": "2022",
      "technologies": ["csharp", "wpf"],
      "imageSrc": "notyet_img.png"
    },
    {
      "id": "5",
      "markdown": "dashboard_finances",
      "github": "https://github.com/HDwayne/Dashboard_gestion_budget",
      "title": "Dashboard for tracking revenues and expenses",
      "description": "This project is a web application built using the Django framework. It serves as a dashboard for managing and tracking the financial aspects of a group travel. The application allows users to input and manage financial data such as revenues and expenses. The goal of this project is to provide a tool for travel groups to manage and understand their financial data, making it easier for them to plan and execute a successful trip.",
      "type": "Web application",
      "year": "2021",
      "technologies": ["html5", "css3", "python", "django"],
      "imageSrc": "dashboard_finance_img.webp"
    }
  ],
  "education": [
    {
      "id": "5",
      "start": "2024",
      "end": "2025",
      "title": "Paul Sabatier University, Toulouse (31)",
      "description": "Master's degree (M2) in computer science with a focus on Embedded and Connected Systems: Infrastructure and Software"
    },
    {
      "id": "4",
      "start": "2023",
      "end": "2024",
      "title": "Paul Sabatier University, Toulouse (31)",
      "description": "Master's degree (M1) in computer science with a focus on Embedded and Connected Systems: Infrastructure and Software"
    },
    {
      "id": "3",
      "start": "2020",
      "end": "2023",
      "title": "Paul Sabatier University, Toulouse (31)",
      "description": "Bachelor's degree in computer science"
    },
    {
      "id": "2",
      "start": "2022",
      "title": "Scouts of the World Award (SOWA)"
    },
    {
      "id": "1",
      "start": "2017",
      "end": "2020",
      "title": "Pierre Bourdieu General High School, Fronton (31)",
      "description": "Scientific Baccalaureate"
    }
  ],
  "experiences": [
    {
      "id": "4",
      "start": "June 2023",
      "end": "August 2023",
      "title": "Multipurpose employee | E.Leclerc Autoroute, Aire du frontonnais",
      "description": "Cashier and warehouseman, covering the areas of cashiering, shelving, product reception and service station maintenance."
    },
    {
      "id": "3",
      "start": "February 2023",
      "end": "April 2023",
      "title": "Internship | Midi-Pyrénées Observatory, Toulouse, France",
      "description": "Development of a visualization and validation tool for meteorological and chemical data from the Pic du Midi de Bigorre environmental measurement station."
    },
    {
      "id": "2",
      "start": "July 2022",
      "end": "August 2022",
      "title": "Volunteer work | Riosucio, Caldas, Colombia",
      "description": "scouting project in Colombia where I had the opportunity to engage in cultural exchanges with young people supported by the Portal de Luz Corporation, a charity organization dedicated to helping children in need."
    },
    {
      "id": "1",
      "start": "May 2021",
      "end": "July 2021",
      "title": "Multipurpose employee | Paul, Aire du frontonnais",
      "description": "Preparation of products with particular attention to pastries. Handling cash receipts, taking and preparing orders orders, and responsibility for opening and closing of the store."
    }
  ]
}
